[Survived] BlockStatement
src/app/pipes/camel-case.pipe.ts:5:48
 
 @Pipe({ name: 'camelcase' })
 export class CamelCasePipe implements PipeTransform {
-  transform(value: string | undefined): string {
-    if (!value) {
-      return '';
-    }
-    
-    const words: string[] = value.split(' ');
-
-    let output = '';
-
-    for (let word of words) {
-      if (word) {
-        output += word[0].toUpperCase() + word.slice(1).toLowerCase();
-      }
-    }
-
-    output = output[0].toLowerCase() + output.slice(1);
-
-    return output;
-  }
+  transform(value: string | undefined): string {}
 }
 

[Killed] BlockStatement
src/app/pipes/camel-case.pipe.ts:6:17
 @Pipe({ name: 'camelcase' })
 export class CamelCasePipe implements PipeTransform {
   transform(value: string | undefined): string {
-    if (!value) {
-      return '';
-    }
+    if (!value) {}
     
     const words: string[] = value.split(' ');
killedBy: Pipe: CamelCasePipe should replace an undefined value wityh an empty string
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
src/app/pipes/camel-case.pipe.ts:6:9
 @Pipe({ name: 'camelcase' })
 export class CamelCasePipe implements PipeTransform {
   transform(value: string | undefined): string {
-    if (!value) {
+    if (false) {
       return '';
     }
killedBy: Pipe: CamelCasePipe should replace an undefined value wityh an empty string
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Survived] StringLiteral
src/app/pipes/camel-case.pipe.ts:7:14
 export class CamelCasePipe implements PipeTransform {
   transform(value: string | undefined): string {
     if (!value) {
-      return '';
+      return "Stryker was here!";
     }
     

[Killed] BlockStatement
src/app/pipes/camel-case.pipe.ts:14:29
 
     let output = '';
 
-    for (let word of words) {
-      if (word) {
-        output += word[0].toUpperCase() + word.slice(1).toLowerCase();
-      }
-    }
+    for (let word of words) {}
 
     output = output[0].toLowerCase() + output.slice(1);
killedBy: Pipe: CamelCasePipe should camelcase a single word
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/app/pipes/camel-case.pipe.ts:15:11
     let output = '';
 
     for (let word of words) {
-      if (word) {
+      if (false) {
         output += word[0].toUpperCase() + word.slice(1).toLowerCase();
       }
killedBy: Pipe: CamelCasePipe should camelcase a single word
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/app/pipes/camel-case.pipe.ts:15:11
     let output = '';
 
     for (let word of words) {
-      if (word) {
+      if (true) {
         output += word[0].toUpperCase() + word.slice(1).toLowerCase();
       }
killedBy: Pipe: CamelCasePipe should handle multiple space gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] AssignmentOperator
src/app/pipes/camel-case.pipe.ts:16:9
 
     for (let word of words) {
       if (word) {
-        output += word[0].toUpperCase() + word.slice(1).toLowerCase();
+        output -= word[0].toUpperCase() + word.slice(1).toLowerCase();
       }
     }
killedBy: Pipe: CamelCasePipe should camelcase a single word
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Survived] MethodExpression
src/app/pipes/camel-case.pipe.ts:16:43
 
     for (let word of words) {
       if (word) {
-        output += word[0].toUpperCase() + word.slice(1).toLowerCase();
+        output += word[0].toUpperCase() + word.toLowerCase();
       }
     }

[Survived] MethodExpression
src/app/pipes/camel-case.pipe.ts:20:40
       }
     }
 
-    output = output[0].toLowerCase() + output.slice(1);
+    output = output[0].toLowerCase() + output;
 
     return output;

[Survived] ArithmeticOperator
src/app/pipes/camel-case.pipe.ts:20:14
       }
     }
 
-    output = output[0].toLowerCase() + output.slice(1);
+    output = output[0].toLowerCase() - output.slice(1);
 
     return output;
